// 트리 알고리즘
//     계층적인 구조를 표현할 때 사용할 수 있음

//     기본적으로 트리의 크기가 N일 경우, 전체 간선의 개수는 N - 1개

// 이진 탐색 트리 (Binary Search Tree)
//     이진 탐색이 동작할 수 있도록 고안된 효율적인 탐색이 가능한 자료구조
//     이진 탐색 트리 특징
//         왼쪽 자식 노드 < 부모 노드 < 오른쪽 자식 노드
//             부모 노드보다 왼쪽 자식 노드가 작다
//             부모 노드보다 오른쪽 자식 노드가 크다

// 트리의 순회 (Tree Traversal)
//     트리 구조에 포함된 노드를 특정한 방법으로 한 번씩 방문하는 방법
//         트리의 정보를 시각적으로 확인 가능
//     대표적인 트리 순회 방법
//         전위 순회(Pre-order Traverse) : 루트를 먼저 방문
//         중위 순회(in-order Traverse) : 왼쪽 자식을 먼저 방문한 뒤에 루트 방문
//         후위 순회(post-order Traverse) : 오른쪽 자식을 먼저 방문한 뒤에 루트 방문