/**
문제 설명
마틴게일 베팅법이란, 게임에서 돈을 잃으면 그다음 판에 잃은 돈의 두 배를 다시 베팅하는 전략입니다. 동전 앞뒤 맞추기 게임에서 이 베팅법을 사용했을 때 돈을 얼마나 딸 수 있는지 보려고 합니다.

동전 앞뒤 맞추기 게임에서는 이기면 걸었던 액수만큼 돈을 딸 수 있고, 지면 걸었던 액수만큼 돈을 잃습니다.

당신은 첫 판에 항상 100원을 겁니다. 그리고 마틴게일 베팅법에 따라 게임에서 지면 잃은 돈의 두 배를 다음 판에 베팅합니다. 예를 들어, 한 번 지면 다음 판에 100원의 2배인 200원을 걸게 되고, 200원을 걸었는데도 또 지면 다음 판에 200원의 2배인 400원을 걸게 됩니다. 연속해서 지는 도중에 한 번이라도 이긴다면 다시 기본 금액인 100원을 베팅합니다. 이전 판의 2배를 걸어야 하는 상황에서 수중의 돈이 모자라는 경우에는 남은 돈 전부를 건다고 가정합니다. 모든 돈을 잃게 될 경우에는 즉시 게임을 중단하고 더 이상 남은 게임을 진행하지 않습니다.

초기 금액을 나타내는 money와, 당신이 예측한 동전의 면을 순서대로 나타내는 배열 expected, 실제로 나온 동전의 면을 순서대로 나타내는 배열 actual이 매개변수로 주어집니다. 위 문단에 서술된 방식대로 돈을 베팅했을 때, 게임이 끝나고 남은 금액을 return 하도록 solution 함수를 완성해주세요.

제한사항
money는 1,000 이상 100,000 이하인 자연수입니다.
expected와 actual의 길이는 같습니다.
expected와 actual의 길이는 1 이상 10,000 이하입니다.
expected와 actual의 원소는 'H' 또는 'T'이며 각각 동전의 앞면과 뒷면을 나타냅니다.
입출력 예
money	expected	actual	result
1000	['H', 'T', 'H', 'T', 'H', 'T', 'H']	['T', 'T', 'H', 'H', 'T', 'T', 'H']	1400
1200	['T', 'T', 'H', 'H', 'H']	['H', 'H', 'T', 'H', 'T']	900
1500	['H', 'H', 'H', 'T', 'H']	['T', 'T', 'T', 'H', 'T']	0
입출력 예 설명
입출력 예 #1

아래 표는 게임 진행 과정을 나타냅니다.

베팅금액	expected	actual	승패	남은 돈
100	H	T	패	900
200	T	T	승	1100
100	H	H	승	1200
100	T	H	패	1100
200	H	T	패	900
400	T	T	승	1300
100	H	H	승	1400
따라서 남은 돈 1400을 return 합니다.

입출력 예 #2

아래 표는 게임 진행 과정을 나타냅니다.

베팅금액	expected	actual	승패	남은 돈
100	T	H	패	1100
200	T	H	패	900
400	H	T	패	500
500	H	H	승	1000
100	H	T	패	900
따라서 남은 돈 900을 return 합니다.

입출력 예 #3

아래 표는 게임 진행 과정을 나타냅니다.

베팅금액	expected	actual	승패	남은 돈
100	H	T	패	1400
200	H	T	패	1200
400	H	T	패	800
800	T	H	패	0
4번째 게임이 끝났을 때 남은 돈이 0이기 때문에 즉시 게임을 중단하고 더 이상 남은 게임을 진행하지 않습니다. 따라서 남은 돈 0을 return 합니다.
 */

function solution(money, expected, actual) {
    let betting = 100;
    
    for (let i = 0; i < expected.length; i++) {
        if(money === 0) {
            break;
        } else {
            if(expected[i] !== actual[i]) {
                money = money - betting;
                betting = betting * 2;
                
                if(betting > money) betting = money;
            } else {
                money = money + betting;
                betting = 100;
            }
        }
    }
    
    return money;
}