/**
문제 설명
당신은 친구가 만든 암호문을 해석하고자 합니다. 암호문은 다음과 같은 2개의 요소로 구성되어 있습니다.

숫자 문자열
사칙연산 기호
당신은 이 암호문을 해독하는 방법이 바로 숫자 문자열을 2개의 작은 문자열로 분할한 뒤, 두 문자열을 정수로 변환해서 사칙연산 기호에 맞는 연산을 시킨 결과임을 알고 있습니다. 하지만 당신은 숫자 문자열의 어느 부분을 기준으로 하여 이 문자열을 분할해야 할지 모르기 때문에, 모든 경우를 전부 나열하기로 했습니다.

암호문의 숫자 문자열 s와 사칙연산 기호 op가 매개변수로 주어집니다. s를 왼쪽 문자열의 길이가 1, 2, 3, ..., (s의 길이 - 1)이 되도록 두 문자열로 분할했을 때, 암호 해독 결과를 차례대로 배열에 담아 return 하도록 solution 함수를 완성해주세요.

제한사항
s의 길이는 2 이상 10 이하입니다.
op는 "+", "-", "*" 중 하나입니다.
입출력 예
s	op	result
"1234"	"+"	[235,46,127]
"987987"	"-"	[-87978,-7889,0,9792,98791]
"31402"	"*"	[4206,12462,628,6280]
입출력 예 설명
입출력 예 #1

s = 1234, op = "+" (덧셈)입니다.
s를 해독하는 모든 경우의 수는 다음과 같습니다.
s 왼쪽	s 오른쪽	암호 해독 결과
1	234	235
12	34	46
123	4	127
따라서, [235,46,127]을 return 해야 합니다.
입출력 예 #2

s = 987987, op = "-" (뺄셈)입니다.
s를 해독하는 모든 경우의 수는 다음과 같습니다.
s 왼쪽	s 오른쪽	암호 해독 결과
9	87987	-87978
98	7987	-7889
987	987	0
9879	87	9792
98798	7	98791
따라서, [-87978,-7889,0,9792,98791]을 return 해야 합니다.
입출력 예 #3

s = 31402, op = "*" (곱셈)입니다.
s를 해독하는 모든 경우의 수는 다음과 같습니다.
s 왼쪽	s 오른쪽	암호 해독 결과
3	1402	4206
31	402	12462
314	02	628
3140	2	6280
따라서, [4206,12462,628,6280]을 return 해야 합니다.
 */

function solution(s, op) {
    let answer = [];
    let left = '';
    let right = '';
    let cal = 0;
    
    for(let i = 0; i < s.length - 1; i++) {
        left = s.substring(0, i + 1);
        right = s.replace(left, '');
        
        if(op === "+") {
            cal = Number(left) + Number(right);
            answer.push(cal);
        } else if (op === "-") {
            cal = Number(left) - Number(right);
            answer.push(cal);
        } else if(op === "*") {
            cal = Number(left) * Number(right);
            answer.push(cal);
        }
    }
    
    return answer;
}